import pandas as pd
import pytest


@pytest.fixture
def sample_df():
    """Создает тестовый набор данных"""
    data = {
        'Дата операции': [
            '01.01.2023', '05.01.2023', '15.01.2023',
            '01.02.2023', '20.01.2023'
        ],
        'Сумма платежа': [
            '-1 000,50', '500,00', '-2000',
            '-300,00', ' 1 500 , 00 '
        ],
        'Категория': ['Еда', 'Зарплата', 'Транспорт', 'Еда', 'Бонус']
    }
    return pd.DataFrame(data)

@pytest.fixture
def complex_df():
    """Создает набор данных с расходами, доходами и переводами"""
    data = {
        'Дата операции': ['01.01.2023'] * 6,
        'Сумма платежа': ['-100,00', '-200,00', '1000,00', '-500,00', '-50,00', '200,00'],
        'Сумма операции': [-100.0, -200.0, 1000.0, -500.0, -50.0, 200.0],
        'Категория': ['Еда', 'Транспорт', 'Зарплата', 'Переводы', 'Связь', 'Бонус']
    }
    return pd.DataFrame(data)

@pytest.fixture
def sample_df_services():
        return pd.DataFrame({
        "Дата операции": ["01/03/2024", "15/03/2024"],
        "Категория": ["Супермаркеты", "Аптеки"],
        "Кэшбэк": [100, 50],
        "Бонусы (включая кэшбэк)": [100, 50],
        "Сумма платежа": [1000, 500]
    })

@pytest.fixture
def sample_data():
    """Создает тестовый DataFrame с транзакциями."""
    data = {
        "Дата операции": ["01.01.2024", "15.01.2024", "01.03.2024", "01.06.2024"],
        "Категория": ["Продукты", "Продукты", "Аптеки", "Продукты"],
        "Сумма": [100, 200, 500, 1000]
    }
    return pd.DataFrame(data)
